INSERT INTO theatre VALUES
    (1, 'Большой театр', 450, 230, 100, 23, 'Лесная', 'Москва', 'Россия'),
    (2, 'Молодежный театр', 50, 30, 30, 3, 'Ленина', 'Москва', 'Россия'),
    (3, 'Пионерский театр', 45, 55, 10, 6, 'Алмазная', 'Минск', 'Беларусь'),
    (4, 'РАМТ', 100, 50, 10, 2, 'Театральная площадь', 'Москва', 'Россия'),
    (5, 'Современник', 150, 70, 40, 17, 'Чистопрудный бульвар', 'Москва', 'Россия'),
    (6, 'Театр на Таганке', 200, 150, 110, 76, 'Земляной Вал', 'Москва', 'Россия'),
    (7, 'Мариинский театр', 500, 250, 200, 1, 'Театральная площадь', 'Санкт-Петербург', 'Россия'),
    (8, 'Молодежный театр на Фонтанке', 70, 10, 8, 114, 'набережная реки Фонтанки', 'Санкт-Петербург', 'Россия'),
    (9, 'Угол', 50, 10, 10, 25, 'Парижской Коммуны', 'Казань', 'Россия'),
    (10, 'Приморский краевой драматический театр молодежи', 500, 300, 100, 15, 'Светланская', 'Владивосток', 'Россия'),
    (11, 'Красноярский театр кукол', 100, 20, 0, 45, 'Центральная', 'Красноярск', 'Россия'),
    (12, 'Молодежный театр', 300, 50, 60, 17, 'Козлова', 'Минск', 'Беларусь'),
    (13, 'Театр имени Горького', 150, 75, 24, 5, 'Володарского', 'Минск', 'Беларусь'),
    (14, 'Малый театр', 4, 2, 1, 77, 'Малая', 'Мальск', 'Россия');

INSERT INTO schedule VALUES
    (1, 1, 1, '2020-10-19 10:30:00', 448, 230, 100, 1000, 2000, 3000),
    (2, 1, 1, '2020-11-19 20:30:00', 440, 230, 100, 1000, 2000, 3000),
    (3, 2, 2, '2020-10-30 19:00:00', 49, 30, 30, 100, 200, 300),
    (4, 3, 5, '2020-10-20 19:00:00', 150, 70, 40, 100, 200, 300),
    (5, 3, 8, '2020-10-30 20:30:00', 70, 10, 8, 100, 200, 300),
    (6, 7, 9, '2020-10-30 19:00:00', 50, 10, 10, 100, 200, 300),
    (7, 3, 2, '2020-10-30 15:00:00', 50, 30, 30, 100, 200, 300),
    (8, 4, 11, '2020-10-25 19:00:00', 100, 20, 0, 100, 200, 300),
    (9, 5, 2, '2020-10-24 19:00:00', 50, 30, 30, 100, 200, 300),
    (10, 5, 12, '2020-10-30 19:00:00', 300, 50, 60, 100, 200, 300),
    (11, 6, 2, '2020-10-21 18:10:00', 50, 30, 30, 100, 200, 300);

INSERT INTO participant VALUES
    (1, 'Чернов', 'Василий'),
    (2, 'Безруков', 'Сергей'),
    (3, 'Алексеев', 'Петр'),
    (4, 'Андреев', 'Петр'),
    (5, 'Киселев', 'Ярослав'),
    (6, 'Недумов', 'Владислав'),
    (7, 'Коробейников', 'Олег'),
    (8, 'Головин', 'Александр'),
    (9, 'Евстигнеев', 'Евгений'),
    (10, 'Карпин', 'Андрей'),
    (11, 'Можаев', 'Егор'),
    (12, 'Хлопников', 'Игорь'),
    (13, 'Огурцов', 'Александр'),
    (14, 'Помидоров', 'Андрей');

INSERT INTO performance VALUES
    (1, 'Мурзилка', '01:00', 'Спектакль', 7.5, 1),
    (2, 'Война и мир', '02:00', 'Мюзикл', 9.3, 1),
    (3, 'Идиот', '02:20', 'Спектакль', 8.7, 2),
    (4, 'Анна Каренина', '02:40', 'Мюзикл', 9.6, 2),
    (5, 'Интуиция', '01:20', 'Мюзикл', 8.0, 2),
    (6, 'Эраст Фандорин', '02:30', 'Спектакль', 8.8, 3),
    (7, 'Сын', '01:00', 'Спектакль', 8.5, 2),
    (8, 'Отец', '01:00', 'Опера', 8.1, 2),
    (9, 'Свадьба', '01:00', 'Комедия', 6.8, 2),
    (10, 'Великан', '01:00', 'Мюзикл', 7.8, 2),
    (11, 'Спасатель', '02:00', 'Спектакль', 7.5, 2),
    (12, 'Монте-Кристо', '01:50', 'Спектакль', 8.9, 2);

INSERT INTO ticket VALUES
    (1, 'Пупкин', 'Василий', 4, 500, 1),
    (2, 'Пупкина', 'Екатерина', 5, 500, 1),
    (3, 'Попов', 'Владимир', 6, 500, 2),
    (4, 'Петров', 'Иван', 4, 500, 2),
    (5, 'Иванова', 'Анна', 5, 500, 3),
    (6, 'Краснова', 'Екатерина', 50, 500, 2),
    (7, 'Желткова', 'Екатерина', 23, 500, 2),
    (8, 'Магистрова', 'Елена', 1, 500, 2),
    (9, 'Померанцев', 'Алексей', 24, 500, 2),
    (10, 'Керн', 'Анна', 11, 500, 2),
    (11, 'Оловянный', 'Даниил', 2, 500, 2),
    (12, 'Мечников', 'Владимир', 3, 500, 2),
    (13, 'Готькова', 'Евгения', 9, 500, 2);

INSERT INTO participance VALUES
    (1, 1, 1, 'актер'),
    (2, 2, 1, 'актер'),
    (3, 4, 14, 'актер'),
    (4, 2, 13, 'актер'),
    (5, 2, 4, 'актер'),
    (6, 2, 6, 'актер'),
    (7, 2, 7, 'актер'),
    (8, 1, 9, 'актер'),
    (9, 2, 10, 'актер');
