INSERT INTO theatre VALUES
    (1, 'Большой театр', 450, 230, 100, 23, 'Лесная', 'Москва', 'Россия'),
    (2, 'Молодежный театр', 50, 30, 30, 3, 'Ленина', 'Москва', 'Россия'),
    (3, 'Пионерский театр', 45, 55, 10, 6, 'Алмазная', 'Минск', 'Беларусь'),
    (4, 'РАМТ', 100, 50, 10, 2, 'Театральная площадь', 'Москва', 'Россия'),
    (5, 'Современник', 150, 70, 40, 17, 'Чистопрудный бульвар', 'Москва', 'Россия'),
    (6, 'Театр на Таганке', 200, 150, 110, 76, 'Земляной Вал', 'Москва', 'Россия'),
    (7, 'Мариинский театр', 500, 250, 200, 1, 'Театральная площадь', 'Санкт-Петербург', 'Россия'),
    (8, 'Молодежный театр на Фонтанке', 70, 10, 8, 114, 'набережная реки Фонтанки', 'Санкт-Петербург', 'Россия'),
    (9, 'Угол', 50, 10, 10, 25, 'Парижской Коммуны', 'Казань', 'Россия'),
    (10, 'Приморский краевой драматический театр молодежи', 500, 300, 100, 15, 'Светланская', 'Владивосток', 'Россия'),
    (11, 'Красноярский театр кукол', 100, 20, 0, 45, 'Центральная', 'Красноярск', 'Россия'),
    (12, 'Молодежный театр', 300, 50, 60, 17, 'Козлова', 'Минск', 'Беларусь'),
    (13, 'Театр имени Горького', 150, 75, 24, 5, 'Володарского', 'Минск', 'Беларусь');

INSERT INTO schedule VALUES
    (1, 1, 1, '2020-10-19 10:30:00', 2, 3, 4, 1000, 2000, 3000),
    (2, 1, 1, '2020-11-19 20:30:00', 2, 3, 4, 1000, 2000, 3000),
    (3, 2, 2, '2020-10-30 19:00:00', 20, 30, 0, 100, 200, 300),
    (4, 3, 5, '2020-10-20 19:00:00', 25, 30, 0, 100, 200, 300),
    (5, 3, 8, '2020-10-30 20:30:00', 10, 20, 2, 100, 200, 300),
    (6, 7, 9, '2020-10-30 19:00:00', 50, 5, 10, 100, 200, 300),
    (7, 3, 2, '2020-10-30 15:00:00', 43, 13, 3, 100, 200, 300),
    (8, 4, 11, '2020-10-25 19:00:00', 67, 13, 0, 100, 200, 300),
    (9, 5, 2, '2020-10-24 19:00:00', 27, 29, 10, 100, 200, 300),
    (10, 5, 12, '2020-10-30 19:00:00', 278, 34, 23, 100, 200, 300),
    (11, 6, 2, '2020-10-21 18:10:00', 20, 30, 10, 100, 200, 300);

INSERT INTO participant VALUES
    (1, 'Чернов', 'Василий'),
    (2, 'Безруков', 'Сергей'),
    (3, 'Алексеев', 'Петр');

INSERT INTO performance VALUES
    (1, 'Мурзилка', '01:00', 'Спектакль', 7.5, 1),
    (2, 'Война и мир', '02:00', 'Мюзикл', 9.3, 1),
    (3, 'Идиот', '02:20', 'Спектакль', 8.7, 2),
    (4, 'Анна Каренина', '02:40', 'Мюзикл', 9.6, 2),
    (5, 'Интуиция', '01:20', 'Мюзикл', 8.0, 2),
    (6, 'Эраст Фандорин', '02:30', 'Спектакль', 8.8, 3),
    (7, 'Сын', '01:00', 'Спектакль', 8.5, 2);

INSERT INTO ticket VALUES
    (1, 'Пупкин', 'Василий', 4, 500, 1),
    (2, 'Пупкина', 'Екатерина', 5, 500, 1),
    (3, 'Попов', 'Владимир', 6, 500, 2),
    (4, 'Петров', 'Иван', 4, 500, 2),
    (5, 'Иванова', 'Анна', 5, 500, 3),
    (6, 'Краснова', 'Екатерина', 50, 500, 2);

INSERT INTO participance VALUES
    (1, 1, 1, 'актер'),
    (2, 2, 1, 'актер');
